#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-REGADMIN.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_UAT/REG_ADMIN"]: Refreshing state... [id=moh_applications/client/c2d45ac3-fd76-4dfd-a309-034eb83f7555/scope-mappings/045f3224-9637-4785-a661-fc6f028804d2/620734a9-4036-47f9-8cf6-64e9698f004e]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-REGADMIN.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_CONF/REG_ADMIN"]: Refreshing state... [id=moh_applications/client/c2d45ac3-fd76-4dfd-a309-034eb83f7555/scope-mappings/c0fe2e9f-6937-4ffa-9296-d786d9b0a98b/92a2dc0e-0595-4d15-b5a3-87e56140e441]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-REGADMIN.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_IAT/REG_ADMIN"]: Refreshing state... [id=moh_applications/client/c2d45ac3-fd76-4dfd-a309-034eb83f7555/scope-mappings/a837283e-f96e-446d-9c51-5ac7d0eab773/d1edf467-3b43-45a5-be8d-482d1c0dd3ef]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-DEVELOPER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/27967216-03f7-4259-b50a-955b995d51ad]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-MID-TIER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/4e3d322a-fbe7-438d-8ee7-95a1707d40dc]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-DBA.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/9ada1d3b-be63-40a3-84f2-e4ec0e10be88]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-QA.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/1798203d-027f-4856-a445-8a90c1dc9756]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-QA.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/658f081c-a8b0-4c1b-b9ee-7e8901158ce7]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-DEVELOPER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/ba2aead8-cd2d-4519-991b-3bd44c71c057]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-MIDTIER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/782fe94e-79a2-438f-9bc1-28717395b28d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_TEST.module.moh_applications.module.FORMS.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + base_url                                  = "https://formstst.hlth.gov.bc.ca/"
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "FORMS"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Ministry of Health Public Forms Server"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "FORMS"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "https://forms.ddev.site/*",
          + "https://formsdev.hlth.gov.bc.ca/*",
          + "https://formstst.hlth.gov.bc.ca/*",
        ]
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.FORMS.keycloak_openid_client_default_scopes.client_default_scopes will be created
  + resource "keycloak_openid_client_default_scopes" "client_default_scopes" {
      + client_id      = (known after apply)
      + default_scopes = [
          + "email",
          + "profile",
          + "roles",
          + "web-origins",
        ]
      + id             = (known after apply)
      + realm_id       = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.FORMS.keycloak_openid_client_optional_scopes.client_optional_scopes will be created
  + resource "keycloak_openid_client_optional_scopes" "client_optional_scopes" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + optional_scopes = [
          + "address",
          + "microprofile-jwt",
          + "offline_access",
          + "phone",
        ]
      + realm_id        = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.FORMS.keycloak_openid_user_attribute_protocol_mapper.idir_company will be created
  + resource "keycloak_openid_user_attribute_protocol_mapper" "idir_company" {
      + add_to_access_token  = true
      + add_to_id_token      = true
      + add_to_userinfo      = false
      + aggregate_attributes = false
      + claim_name           = "idir_company"
      + claim_value_type     = "String"
      + client_id            = (known after apply)
      + id                   = (known after apply)
      + multivalued          = false
      + name                 = "idir_company"
      + realm_id             = "moh_applications"
      + user_attribute       = "idir_company"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @ahoplock, Action: `pull_request`*